In [13]:
import pandas as pd

In [14]:
df = pd.read_csv('german.csv')

In [15]:
df.head()

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,...,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,1
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,2
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,1
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,1
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,2

In [16]:
# Labeling the columns 
df.columns = ['chk_account','duration','credit_hist','purpose','amount','savings_account',
          'present_emp','installment_rate','sex','other_debtor','present_resd','property',
          'age','other_installment','housing','n_credits', 'job','n_people','telephone','foreign','response']

In [17]:
df.head()

,chk_account,duration,credit_hist,purpose,amount,savings_account,present_emp,installment_rate,sex,other_debtor,...,property,age,other_installment,housing,n_credits,job,n_people,telephone,foreign,response
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,1
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,2
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,1
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,1
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,2

In [18]:
# Converting the response variable into 0(good credit) and 1 (bad credit)
df['response'] = df['response'].apply(lambda x: x-1)

In [19]:
df.head()

,chk_account,duration,credit_hist,purpose,amount,savings_account,present_emp,installment_rate,sex,other_debtor,...,property,age,other_installment,housing,n_credits,job,n_people,telephone,foreign,response
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,0
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,1
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,0
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,0
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,1

In [20]:
# Converting the response variable into a STR (String)
df['response'] = df['response'].apply(str)

In [21]:
df.dtypes

chk_account          object
duration              int64
credit_hist          object
purpose              object
amount                int64
savings_account      object
present_emp          object
installment_rate      int64
sex                  object
other_debtor         object
present_resd          int64
property             object
age                   int64
other_installment    object
housing              object
n_credits             int64
job                  object
n_people              int64
telephone            object
foreign              object
response             object
dtype: object

In [22]:
df.describe()

,duration,amount,installment_rate,present_resd,age,n_credits,n_people
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,20.903000,3271.258000,2.973000,2.845000,35.546000,1.407000,1.155000
std,12.058814,2822.736876,1.118715,1.103718,11.375469,0.577654,0.362086
min,4.000000,250.000000,1.000000,1.000000,19.000000,1.000000,1.000000
25%,12.000000,1365.500000,2.000000,2.000000,27.000000,1.000000,1.000000
50%,18.000000,2319.500000,3.000000,3.000000,33.000000,1.000000,1.000000
75%,24.000000,3972.250000,4.000000,4.000000,42.000000,2.000000,1.000000
max,72.000000,18424.000000,4.000000,4.000000,75.000000,4.000000,2.000000